#    -*- mode: org -*-


Archived entries from file /Users/dbanks/Dropbox/darrellbanks.com/org/projects.org


** DONE Add final radio buttons 
- State "DONE"       from "TODO"       [2024-06-25 Tue 09:50]
:LOGBOOK:
CLOCK: [2024-06-17 Mon 10:13]--[2024-06-17 Mon 10:33] =>  0:20
:END:
Added: [2024-06-17 Mon 10:12]
** DONE Add QR Code section
- State "DONE"       from "TODO"       [2024-06-25 Tue 10:32]
:LOGBOOK:
CLOCK: [2024-06-25 Tue 10:00]--[2024-06-25 Tue 10:25] =>  0:25
:END:
** DONE Add "how to download" modal 
- State "DONE"       from "TODO"       [2024-06-26 Wed 12:16]
:LOGBOOK:
CLOCK: [2024-06-26 Wed 10:56]--[2024-06-26 Wed 11:36] =>  0:40
CLOCK: [2024-06-26 Wed 10:40]--[2024-06-26 Wed 10:40] =>  0:00
CLOCK: [2024-06-25 Tue 10:33]--[2024-06-25 Tue 11:13] =>  0:40
:END:
** TODO Add user and plan data 
:LOGBOOK:
CLOCK: [2024-06-26 Wed 14:07]--[2024-06-26 Wed 14:47] =>  0:40
CLOCK: [2024-06-26 Wed 12:19]--[2024-06-26 Wed 12:59] =>  0:40
:END:
** DONE initial test write-up
- State "DONE"       from "TODO"       [2024-08-06 Tue 10:20]
:LOGBOOK:
CLOCK: [2024-08-05 Mon 10:59]--[2024-08-05 Mon 11:39] =>  0:40
CLOCK: [2024-08-05 Mon 10:24]--[2024-08-05 Mon 10:35] =>  0:11
:END:
** TODO Get up a pull request 
:LOGBOOK:
CLOCK: [2024-08-06 Tue 10:30]--[2024-08-06 Tue 10:47] =>  0:17
:END:

* DONE UA-34: Pharmacy Tab
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-14 Thu 09:36
:ARCHIVE_FILE: ~/Sync/darrellbanks.com/org/projects.org
:ARCHIVE_OLPATH: UHC-A
:ARCHIVE_CATEGORY: projects
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: project
:END:
- State "DONE"       from "WAITING"    [2024-09-10 Tue 13:20]
- State "WAITING"    from "TODO"       [2024-08-27 Tue 10:16]
:LOGBOOK:
CLOCK: [2024-08-07 Wed 10:43]--[2024-08-07 Wed 10:47] =>  0:04
:END:
* DONE Upgrade to headless UI 2.0:  [[id:B1E2986B-C6E7-468F-BA6F-36DB31B91110][Upgrading to HeadlessUI V2]] 
:PROPERTIES:
:ARCHIVE_TIME: 2024-11-14 Thu 09:36
:ARCHIVE_FILE: ~/Sync/darrellbanks.com/org/projects.org
:ARCHIVE_OLPATH: UHC-A
:ARCHIVE_CATEGORY: projects
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: project
:END:
- State "DONE"       from "IN-PROGRESS" [2024-09-10 Tue 13:20]
:LOGBOOK:
CLOCK: [2024-08-27 Tue 14:58]--[2024-08-27 Tue 15:07] =>  0:09
CLOCK: [2024-08-27 Tue 12:44]--[2024-08-27 Tue 13:24] =>  0:40
CLOCK: [2024-08-27 Tue 10:18]--[2024-08-27 Tue 10:58] =>  0:40
:END:
- State "IN-PROGRESS" from "TODO"       [2024-08-27 Tue 10:18]
** DONE Discover root cause of the issue 
- State "DONE"       from "TODO"       [2025-01-15 Wed 10:16]
:LOGBOOK:
CLOCK: [2025-01-15 Wed 10:07]--[2025-01-15 Wed 10:16] =>  0:09
:END:
** DONE Add a test for the fix 
- State "DONE"       from "TODO"       [2025-01-16 Thu 10:46]
:LOGBOOK:
CLOCK: [2025-01-15 Wed 10:39]--[2025-01-15 Wed 11:04] =>  0:25
:END:

** DONE Get essential pieces in place 
- State "DONE"       from "IN-PROGRESS" [2025-01-24 Fri 10:14]
:LOGBOOK:
CLOCK: [2025-01-23 Thu 13:03]--[2025-01-23 Thu 13:28] =>  0:25
CLOCK: [2025-01-23 Thu 12:27]--[2025-01-23 Thu 12:52] =>  0:25
CLOCK: [2025-01-23 Thu 11:56]--[2025-01-23 Thu 12:21] =>  0:25
CLOCK: [2025-01-23 Thu 10:09]--[2025-01-23 Thu 10:34] =>  0:25
:END:
- State "IN-PROGRESS" from "TODO"       [2025-01-23 Thu 10:09]
** DONE Add tests 
- State "DONE"       from "TODO"       [2025-01-28 Tue 10:19]
:LOGBOOK:
CLOCK: [2025-01-24 Fri 10:15]--[2025-01-24 Fri 10:40] =>  0:25
:END:
* DONE implement Article Schema
:PROPERTIES:
:ARCHIVE_TIME: 2025-02-03 Mon 09:47
:ARCHIVE_FILE: ~/Sync/darrellbanks.com/org/projects.org
:ARCHIVE_OLPATH: HelloMedicare
:ARCHIVE_CATEGORY: projects
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: project
:END:
- State "DONE"       from "TODO"       [2025-01-30 Thu 10:27]
:LOGBOOK:
CLOCK: [2025-01-28 Tue 10:30]--[2025-01-28 Tue 10:55] =>  0:25
:END:
** DONE Understand the sitemap generator
- State "DONE"       from "TODO"       [2025-01-30 Thu 10:32]
:LOGBOOK:
CLOCK: [2025-01-30 Thu 10:29]--[2025-01-30 Thu 10:32] =>  0:03
:END:
Turns out, this was already done in a previous ticket.

*** DONE Understand reusability of zip entry 
- State "DONE"       from "IN-PROGRESS" [2025-02-13 Thu 09:49]
- State "IN-PROGRESS" from "TODO"       [2025-02-11 Tue 10:37]
:LOGBOOK:
CLOCK: [2025-02-11 Tue 10:37]--[2025-02-11 Tue 11:02] =>  0:25
:END:
*** IN-PROGRESS Add zip entry to page 
:LOGBOOK:
CLOCK: [2025-02-13 Thu 10:54]
CLOCK: [2025-02-13 Thu 09:50]--[2025-02-13 Thu 10:15] =>  0:25
:END:
- State "IN-PROGRESS" from "TODO"       [2025-02-13 Thu 09:49]
*** DONE Add anchor link ids to heading 
- State "DONE"       from "TODO"       [2025-02-05 Wed 12:35]
:LOGBOOK:
CLOCK: [2025-02-05 Wed 10:23]--[2025-02-05 Wed 10:48] =>  0:25
:END:
*** DONE Create anchor link component which accepts an article  
- State "DONE"       from "IN-PROGRESS" [2025-02-05 Wed 15:00]
:LOGBOOK:
CLOCK: [2025-02-05 Wed 14:57]--[2025-02-05 Wed 15:00] =>  0:03
CLOCK: [2025-02-05 Wed 14:25]--[2025-02-05 Wed 14:50] =>  0:25
CLOCK: [2025-02-05 Wed 13:53]--[2025-02-05 Wed 14:18] =>  0:25
:END:
- State "IN-PROGRESS" from "TODO"       [2025-02-05 Wed 12:36]
*** DONE Create heading component with intersection observer 
- State "DONE"       from "IN-PROGRESS" [2025-02-11 Tue 10:35]
:LOGBOOK:
CLOCK: [2025-02-07 Fri 10:52]--[2025-02-07 Fri 11:17] =>  0:25
CLOCK: [2025-02-07 Fri 10:12]--[2025-02-07 Fri 10:37] =>  0:25
CLOCK: [2025-02-06 Thu 14:15]--[2025-02-06 Thu 14:40] =>  0:25
CLOCK: [2025-02-06 Thu 13:45]--[2025-02-06 Thu 14:10] =>  0:25
CLOCK: [2025-02-06 Thu 13:15]--[2025-02-06 Thu 13:40] =>  0:25
CLOCK: [2025-02-06 Thu 10:21]--[2025-02-06 Thu 10:46] =>  0:25
CLOCK: [2025-02-05 Wed 15:36]--[2025-02-05 Wed 16:01] =>  0:25
:END:
- State "IN-PROGRESS" from "TODO"       [2025-02-05 Wed 15:01]
** DONE [[[https://rvohealth.atlassian.net/browse/UHCMC-2578][UHCMC-2578]]] Create MedicalReviewer component
- State "DONE"       from "TODO"       [2025-02-03 Mon 09:48]
:LOGBOOK:
CLOCK: [2025-01-30 Thu 10:37]--[2025-01-30 Thu 11:02] =>  0:25
:END:
** DONE [[[https://rvohealth.atlassian.net/browse/UHCMC-2585][UHCMC-2585]]] Create Medically Reviewed Badge
- State "DONE"       from "TODO"       [2025-02-05 Wed 09:38]
:LOGBOOK:
CLOCK: [2025-02-03 Mon 09:50]--[2025-02-03 Mon 10:15] =>  0:25
:END:
